{"id": "018b1c54f27fc440efdc2d1cfb4acae2", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n\nShared Task: Machine Translation of News\n\n", "metadata": {"heading": "# Translation Task - ACL 2019 fourth Conference on Machine Translation", "heading_level": 1, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation"], "parent_headers": [], "domain": "www.statmt.org", "word_count": 17, "char_count": 114, "nested_level": 0}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.370881", "chunk_type": "section"}
{"id": "ad8534a2695d94735e353410c74e2b2c", "content": "## Shared Task: Machine Translation of News The recurring translation task of the WMT workshops focuses on news text and (mostly) European language pairs. For this year the language pairs are: Chinese-English Czech-English (this year English-to-Czech only) Finnish-English German-English Gujarati-English Kazakh-English Lithuanian-English Russian-English German-Czech (only into Czech, only unsupervised MT / without parallel data) NEW French-German (topic: EU elections) We provide parallel corpora for all languages as training data, and additional resources for download. GOALS The goals of the shared translation task are: To investigate the applicability of current MT techniques when translating into languages other than English To examine special challenges in translating between European languages, including word order differences and morphology To investigate the translation of low-resource, morphologically rich languages To create publicly available corpora for machine translation and machine translation evaluation To generate up-to-date performance numbers in order to provide a basis of comparison in future research To offer newcomers a smooth start with hands-on experience in state-of-the-art statistical machine translation methods To investigate the usefulness of multilingual and third language resources To compare unsupervised MT in a controlled environment To assess the effectiveness of document-level approaches We hope that both beginners and established research groups will", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 0, "word_count": 200, "char_count": 1506, "nested_level": 1, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371103", "chunk_type": "content_chunk"}
{"id": "862245012ef42e8cb6be6c2a8bcb644c", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nstate-of-the-art statistical machine translation methods To investigate the usefulness of multilingual and third language resources To compare unsupervised MT in a controlled environment To assess the effectiveness of document-level approaches We hope that both beginners and established research groups will participate in this task. IMPORTANT DATES Release of training data for shared tasks (by)31 January, 2019 Test suite source texts must reach us March 24, 2019 Test data released April 8, 2019 Translation submission deadlineApril 16, 2019 (10am UK) Translated test suites shipped back to test suites authors April 26, 2019 Start of manual evaluationApril 29, 2019 End of manual evaluation May 27, 2019 TASK DESCRIPTION We provide training data for all language pairs, and a common framework. The task is to improve current methods. We encourage a broad participation -- if you feel that your method is interesting but not state-of-the-art, then please participate in order to disseminate it and measure progress. Participants will use their systems to translate a test set of unseen sentences in the source language. The translation quality is measured by a manual evaluation and various automatic evaluation metrics. Participants agree to contribute to the manual evaluation about eight hours of work, per system submission.", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 1, "word_count": 200, "char_count": 1448, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371126", "chunk_type": "content_chunk"}
{"id": "01d0f53af21db8021ddb4adb4cb310e1", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\na test set of unseen sentences in the source language. The translation quality is measured by a manual evaluation and various automatic evaluation metrics. Participants agree to contribute to the manual evaluation about eight hours of work, per system submission. You may participate in any or all of the eight language pairs. For all language pairs we will test translation in both directions. To have a common framework that allows for comparable results, and also to lower the barrier to entry, we provide a common training set, and a pre-processed version (TBC). You are not limited to this training set, and you are not limited to the training set provided for your target language pair. This means that multilingual systems are allowed, and classed as constrained as long as they use only data released for WMT19 (or older WMT Hindi-English and Turkish-English corpora, as listed below). If you use additional training data (not provided by the WMT19 organisers) or existing translation systems, you must flag that your system uses additional data. We will distinguish system submissions that used the provided training data (constrained) from submissions that used significant additional data resources. Note that basic linguistic tools such as taggers, parsers,", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 2, "word_count": 200, "char_count": 1385, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371143", "chunk_type": "content_chunk"}
{"id": "3e3fea783b15de1569d0d86bceca9bd8", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\ntranslation systems, you must flag that your system uses additional data. We will distinguish system submissions that used the provided training data (constrained) from submissions that used significant additional data resources. Note that basic linguistic tools such as taggers, parsers, or morphological analyzers are allowed in the constrained condition. Your submission report should highlight in which ways your own methods and data differ from the standard task. You should make it clear which tools you used, and which training sets you used. The following two aspects of the task are new for 2019: Unsupervised learning and Document-level MT. Unsupervised learning For 2019, we also have an unsupervised subtrack: German to Czech translations, using monolingual German and Czech training data only, as well as last years' parallel dev and test sets for bootstrapping. The training data should come from the the constrained monolingual sets of WMT news translation data. No German-Czech parallel data is provided, and the participants cannot use any monolingual or parallel data for other languages and language pairs (thus zero-shot, transfer-learning and pivoting-based systems will be treated as part of the general news translation track). Document-level MT In 2019, we are particularly interested in approaches which consider the", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 3, "word_count": 200, "char_count": 1457, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371156", "chunk_type": "content_chunk"}
{"id": "5e36847ab707903cc828dbc2eead42f6", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nmonolingual or parallel data for other languages and language pairs (thus zero-shot, transfer-learning and pivoting-based systems will be treated as part of the general news translation track). Document-level MT In 2019, we are particularly interested in approaches which consider the whole document. We invite submissions of such approaches for English to German and Czech, and for Chinese to English. We will perform document-level human evaluation for these pairs. For English to German, we will be releasing as much of the training data as possible with document boundaries intact. For English to Czech, CzEng 1.7 (unchanged from last year) does already offer cross-sentential context for most of its \"domains\". No complete documents are available but all sentences in a \"block\" (i.e. those with the same \"-bNUM-\" number in the ID, e.g. subtitlesM-b15-00train-f000001-s*) formed a consecutive sequence in the original text. Sometimes the block is very short (just 1 sentence), and it is always limited to 13 or 15 sentences. No context information is available for the domains \"techdoc\", \"navajo\" and \"tweets\". The best context-aware domains are \"news\", \"eu\", \"subtitles*\" (well, subtitles) and \"fiction\". Additional Test Suites Linked to News Translation Task At no additional burden on the News Translation Task participants", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 4, "word_count": 200, "char_count": 1446, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371167", "chunk_type": "content_chunk"}
{"id": "d82f1aa3635fee5830830fc10d3540b0", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\ninformation is available for the domains \"techdoc\", \"navajo\" and \"tweets\". The best context-aware domains are \"news\", \"eu\", \"subtitles*\" (well, subtitles) and \"fiction\". Additional Test Suites Linked to News Translation Task At no additional burden on the News Translation Task participants (aside from having to translate much larger input data), we will again collectively provide a deeper analysis of various qualities of the translations. See the corresponding section of Findings 2018 for an inspiration. See WMT19 Test Suites Google Document for more details. System developers may want to learn in advance what their systems will be tested on. Everyone is welcome to contribute additional test suites. Authors of additional test suites will be invited to report on their evaluation method and its results in a separate paper DATA LICENSING OF DATA The data released for the WMT19 news translation task can be freely used for research purposes, we just ask that you cite the WMT19 shared task overview paper, and respect any additional citation requirements on the individual data sets. For other uses of the data, you should consult with original owners of the data sets. TRAINING DATA We aim to use publicly available sources of data wherever possible. Our main", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 5, "word_count": 200, "char_count": 1385, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371179", "chunk_type": "content_chunk"}
{"id": "e1371ba607a4ea881a033f9f14b77380", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nany additional citation requirements on the individual data sets. For other uses of the data, you should consult with original owners of the data sets. TRAINING DATA We aim to use publicly available sources of data wherever possible. Our main sources of training data are the Europarl corpus, the UN corpus, the news-commentary corpus and the ParaCrawl corpus. We also release a monolingual News Crawl corpus. Other language-specific corpora will be made available. We have added suitable additional training data to some of the language pairs. You may also use the following monolingual corpora released by the LDC: LDC2011T07 English Gigaword Fifth Edition LDC2009T13 English Gigaword Fourth Edition LDC2007T07 English Gigaword Third Edition LDC2009T27 Chinese Gigaword Fourth Edition Note that the released data is not tokenized and includes sentences of any length (including empty sentences). All data is in Unicode (UTF-8) format. The following Moses tools allow the processing of the training data into tokenized format: Tokenizer tokenizer.perl Detokenizer detokenizer.perl Lowercaser lowercase.perl SGML Wrapper wrap-xml.perl These tools are available in the Moses git repository. DEVELOPMENT DATA To evaluate your system during development, we suggest using the 2018 test set. The data is provided in raw text format and in an", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 6, "word_count": 200, "char_count": 1452, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371192", "chunk_type": "content_chunk"}
{"id": "ce17fcdf1e9b6897cc893fc9a326f4d6", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nLowercaser lowercase.perl SGML Wrapper wrap-xml.perl These tools are available in the Moses git repository. DEVELOPMENT DATA To evaluate your system during development, we suggest using the 2018 test set. The data is provided in raw text format and in an SGML format that suits the NIST scoring tool. We also release other dev and test sets from previous years. For the new language pairs, we release dev sets in January, prepared in the same way as the test sets. Year CS-EN DE-EN FI-EN GU-EN KK-EN LT-EN RU-EN ZH-EN FR-DE 2008 ✓ ✓ ✓ 2009 ✓ ✓ ✓ 2010 ✓ ✓ ✓ 2011 ✓ ✓ ✓ 2012 ✓ ✓ ✓ ✓ 2013 ✓ ✓ ✓ ✓ 2014 ✓ ✓ ✓ ✓ 2015 ✓ ✓ ✓ ✓ 2016 ✓ ✓ ✓ ✓ 2017 ✓ ✓ ✓ ✓ ✓ 2018 ✓ ✓ ✓ ✓ ✓ The 2019 test sets will be created from a sample of online newspapers from September-November 2018. For the established languages (i.e. English to/from Chinese, Czech, German, Finnish and Russian) the English-X and X-English test sets will be distinct, and only consist of documents created originally in the source language. For the new languages (i.e English to/from Gujarati, Kazakh", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 7, "word_count": 200, "char_count": 1164, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371210", "chunk_type": "content_chunk"}
{"id": "9ca3ef093578b975ecc8de864a45d943", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nestablished languages (i.e. English to/from Chinese, Czech, German, Finnish and Russian) the English-X and X-English test sets will be distinct, and only consist of documents created originally in the source language. For the new languages (i.e English to/from Gujarati, Kazakh and Lithuanian) the test sets include 50% English-X translation, and 50% X-English translation. In previous recent tasks, all the test data was created using the latter method. We have released development data for the tasks that are new this year. It is created in the same way as the test set and included in the development tarball. The news-test2011 set has three additional Czech translations that you may want to use. You can download them from Charles University. DOWNLOAD Parallel data: File CS-EN DE-EN FI-EN GU-EN KK-EN LT-EN RU-EN ZH-EN FR-DE Notes Europarl v9 ✓ ✓ ✓ ✓ ✓ * New: Re-extracted to include document boundaries. *: europarl-v7 for fr-de ParaCrawl v3 ✓ ✓ ✓ ✓ ✓ ✓ New version for 2019 (except en-ru). Please use the bicleaner filtered version. Common Crawl corpus ✓ ✓ ✓ ✓ * Same as last year. *: new for fr-de News Commentary v14 ✓ ✓ ✓ ✓ ✓ ✓ Updated, and now with document", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 8, "word_count": 200, "char_count": 1286, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371226", "chunk_type": "content_chunk"}
{"id": "14745f91913b8e59e7c70a987f2f0758", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nfor 2019 (except en-ru). Please use the bicleaner filtered version. Common Crawl corpus ✓ ✓ ✓ ✓ * Same as last year. *: new for fr-de News Commentary v14 ✓ ✓ ✓ ✓ ✓ ✓ Updated, and now with document boundaries. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. CzEng 1.7 ✓ Register and download CzEng 1.7. (cross-sentential context available for some domains) Yandex Corpus ✓ ru-en Wiki Titles v1 ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ New release for 2019 UN Parallel Corpus V1.0 ✓ ✓ Register and download Rapid corpus of EU press releases ✓ ✓ This is part of the Tilde Model Corpus Document-split Rapid corpus ✓ New A recrawled version of the Rapid corpus, with document boundaries intact. Also prepared by Tilde. CWMT Corpus ✓ Additional training data for Gujarati-English The only gu-en corpus listed above is Wikititles. In addition, we propose the following data-sets, as well as specifically encouraging unconstrained submissions (i.e. bring your own data). The Bible Corpus, extracted from data available here A Localisation extracted from OPUS, and consisting mainly of", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 9, "word_count": 200, "char_count": 1268, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371242", "chunk_type": "content_chunk"}
{"id": "24bd42c31a72a06255a3f0a23e22875d", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nlisted above is Wikititles. In addition, we propose the following data-sets, as well as specifically encouraging unconstrained submissions (i.e. bring your own data). The Bible Corpus, extracted from data available here A Localisation extracted from OPUS, and consisting mainly of open-source software localisation data. The Emille Corpus, available from ELRA, free for academic use. The Emille corpus is not actually parallel, but does contain some parallel text. Some small corpora which seem to be only available to Indian citizens Crowd-sourced bilingual dictionaries collected by Ellie Pavlick and collaborators The HindEnCorp created by CUNI, or the larger one created by IIT Bombay for the Workshop on Asian Language Translation shared task. If pivoting through Hindi is feasible, then these would be useful. A parallel corpus extracted from wikipedia and contributed by Alexander Molchanov of PROMT. A crawled corpus produced for this task. It is very noisy, but contains some parallel data. A cleaned version is also available, cleaned using language detection and simple length heuristics. We recommened that you either use the cleaned version, or apply your own cleaning to the raw version. You can use the wikipedia en and gu dumps as a comparable corpus. Additional training data for Kazakh-English", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 10, "word_count": 200, "char_count": 1427, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371253", "chunk_type": "content_chunk"}
{"id": "8672b19325db738821469a3e3b1a5a34", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nand simple length heuristics. We recommened that you either use the cleaned version, or apply your own cleaning to the raw version. You can use the wikipedia en and gu dumps as a comparable corpus. Additional training data for Kazakh-English In addition to the wikititles and news-commentary above, we provide: An English-Kazakh crawled corpus of about 100k sentences, prepared by Bagdat Myrzakhmetov of Nazarbayev University. The corpus is distributed as a tsv file with the original URLs included, as well as an alignment score. A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. A an additional English-Kazakh crawled corpus of about 500k sentences, also prepared by Bagdat Myrzakhmetov. NB: this was not part of the task training data We created a -wmt19 version of the news-commentary corpus, which has the dev set removed. You may also use any of the data previously released for the English-Turkish task. Monolingual training data: Corpus CS DE EN FI GU KK LT RU ZH FR Notes News crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Large corpora of crawled news, collected since 2007. Versions up to 2017 are as before, except they are re-filtered and re-shuffled.", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 11, "word_count": 200, "char_count": 1311, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371269", "chunk_type": "content_chunk"}
{"id": "03b04123cd059daf790b1eb3df4e9733", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nKK LT RU ZH FR Notes News crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Large corpora of crawled news, collected since 2007. Versions up to 2017 are as before, except they are re-filtered and re-shuffled. For de and en, document-split versions are available. News discussions ✓ ✓ Updated Corpora crawled from comment sections of online newspapers. Available in English and French. Europarl ✓ ✓ ✓ ✓ ✓ ✓ * Monolingual version of European parliament crawl. Superset of the parallel version. *: europarl-v7 for fr News Commentary ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Monolingual text from news-commentary crawl. Superset of parallel version. Use v14. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. Common Crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Deduplicated with development and evaluation sentences removed. English was updated 31 January 2016 to remove bad UTF-8. Downloads can be verified with SHA512 checksums. More English is available for unconstrained participants. Wiki dumps ✓ ✓ ✓ New Monolingual text wikipedia, extracted using WikiExtractor. Development sets Test sets Test sets", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 12, "word_count": 200, "char_count": 1262, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371284", "chunk_type": "content_chunk"}
{"id": "781618992d90c9e308fdae8c0d4050fa", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nupdated 31 January 2016 to remove bad UTF-8. Downloads can be verified with SHA512 checksums. More English is available for unconstrained participants. Wiki dumps ✓ ✓ ✓ New Monolingual text wikipedia, extracted using WikiExtractor. Development sets Test sets Test sets (including additional test suites) PREPROCESSED DATA We will provide preprocessed versions of all training and development data (by mid-February). These are preprocesed with standard Moses tools and ready for use in MT training. This preprocessed data is distributed with the intention that it will be useful as a standard data set for future research. The preprocessed data can be obtained here TEST SET SUBMISSION To submit your results, please first convert into into SGML format as required by the NIST BLEU scorer, and then upload it to the website matrix.statmt.org. For Chinese output, you should submit unsegmented text, since our primary measure is human evaluation. For automatic scoring (in the matrix) we use BLEU4 computed on characters, scoring with v1.3 of the NIST scorer only. A script to convert a Chinese SGM file to characters can be found here. SGML Format Each submitted file has to be in a format that is used by standard scoring scripts such as NIST", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 13, "word_count": 200, "char_count": 1358, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371299", "chunk_type": "content_chunk"}
{"id": "9504b1b6c02ecafc4fec9514fe01c86b", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nof the NIST scorer only. A script to convert a Chinese SGM file to characters can be found here. SGML Format Each submitted file has to be in a format that is used by standard scoring scripts such as NIST BLEU or TER. This format is similar to the one used in the source test set files that were released, except for: First line is <tstset trglang=\"en\" setid=\"newstest2019\" srclang=\"any\">, with trglang set to either en, de, fr, es, cs or ru. Important: srclang is always any. Each document tag also has to include the system name, e.g. sysid=\"uedin\". CLosing tag (last line) is </tstset> The script wrap-xml.perl makes the conversion of a output file in one-segment-per-line format into the required SGML file very easy: Format: wrap-xml.perl LANGUAGE SRC_SGML_FILE SYSTEM_NAME < IN > OUT Example: wrap-xml.perl en newstest2019-src.de.sgm Google < decoder-output > decoder-output.sgm Upload to Website Upload happens in three easy steps: Go to the website matrix.statmt.org. Create an account under the menu item Account -> Create Account. Go to Account -> upload/edit content, and follow the link \"Submit a system run\" select as test set \"newstest2019\" and the language pair you are submitting select \"create new system\" click \"continue\" on", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 14, "word_count": 200, "char_count": 1358, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371313", "chunk_type": "content_chunk"}
{"id": "783a61b9a95003d9c16d17baf48ab27f", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nthe menu item Account -> Create Account. Go to Account -> upload/edit content, and follow the link \"Submit a system run\" select as test set \"newstest2019\" and the language pair you are submitting select \"create new system\" click \"continue\" on the next page, upload your file and add some description You can use the matrix to list all your systems, and edit the metadata. This is important since after the test week ends, you need to decide which are your primary systems (that get included in the human evaluation, and the overview paper) and to ensure that you are happy with the system naming. To access your system list, log in and select Account -> my current systems. You should see a list of all your systems, along with their metadata, and an edit button. Some instructions are included on this screen. EVALUATION Evaluation will be done both automatically as well as by human judgement. Manual Scoring: We will collect subjective judgments about translation quality from human annotators. If you participate in the shared task, we ask you to perform a defined amount of evaluation per language pair submitted. The amount of manual evaluation will be approximately 8 hours. As", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 15, "word_count": 200, "char_count": 1300, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371325", "chunk_type": "content_chunk"}
{"id": "a08db52ac6acd2b1cab5e6e272ba7814", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n\nsubjective judgments about translation quality from human annotators. If you participate in the shared task, we ask you to perform a defined amount of evaluation per language pair submitted. The amount of manual evaluation will be approximately 8 hours. As in previous years, we expect the translated submissions to be in recased, detokenized, XML format, just as in most other translation campaigns (NIST, TC-Star). ACKNOWLEDGEMENTS This task would not have been possible without the sponsorship of test sets from Microsoft, Yandex, Tilde, LinguaCustodia, the University of Helsinki, Charles University Prague, Le Mans University and funding from the European Union's Horizon 2020 research and innovation programme under grant agreements 825299 (GOURMET) and EU CHIST-ERA M2CR project. - Chinese-English Czech-English (this year English-to-Czech only) Finnish-English German-English Gujarati-English Kazakh-English Lithuanian-English Russian-English German-Czech (only into Czech, only unsupervised MT / without parallel data) NEW French-German (topic: EU elections)", "metadata": {"heading": "## Shared Task: Machine Translation of News", "heading_level": 2, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}], "domain": "www.statmt.org", "position": 16, "word_count": 144, "char_count": 1183, "nested_level": 1, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371337", "chunk_type": "content_chunk"}
{"id": "54cc41a31fea557e7f7df637c1dcc220", "content": "### GOALS The goals of the shared translation task are: To investigate the applicability of current MT techniques when translating into languages other than English To examine special challenges in translating between European languages, including word order differences and morphology To investigate the translation of low-resource, morphologically rich languages To create publicly available corpora for machine translation and machine translation evaluation To generate up-to-date performance numbers in order to provide a basis of comparison in future research To offer newcomers a smooth start with hands-on experience in state-of-the-art statistical machine translation methods To investigate the usefulness of multilingual and third language resources To compare unsupervised MT in a controlled environment To assess the effectiveness of document-level approaches We hope that both beginners and established research groups will participate in this task. - To investigate the applicability of current MT techniques when translating into languages other than English - To examine special challenges in translating between European languages, including word order differences and morphology - To investigate the translation of low-resource, morphologically rich languages - To create publicly available corpora for machine translation and machine translation evaluation - To generate up-to-date performance numbers in order to provide a basis of comparison", "metadata": {"heading": "### GOALS", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > GOALS", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "GOALS"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "position": 0, "word_count": 200, "char_count": 1461, "nested_level": 2, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371383", "chunk_type": "content_chunk"}
{"id": "45cd8a6a7317195f5cced0999d8a7044", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### GOALS\n\ndifferences and morphology - To investigate the translation of low-resource, morphologically rich languages - To create publicly available corpora for machine translation and machine translation evaluation - To generate up-to-date performance numbers in order to provide a basis of comparison in future research - To offer newcomers a smooth start with hands-on experience in state-of-the-art statistical machine translation methods - To investigate the usefulness of multilingual and third language resources - To compare unsupervised MT in a controlled environment - To assess the effectiveness of document-level approaches", "metadata": {"heading": "### GOALS", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > GOALS", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "GOALS"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "position": 1, "word_count": 87, "char_count": 751, "nested_level": 2, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371393", "chunk_type": "content_chunk"}
{"id": "0006820b8f8e2c44228120e5aee7047f", "content": "### IMPORTANT DATES\n\n", "metadata": {"heading": "### IMPORTANT DATES", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > IMPORTANT DATES", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "IMPORTANT DATES"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "word_count": 3, "char_count": 21, "nested_level": 2}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371398", "chunk_type": "section"}
{"id": "b4aac4c19df3fd4fa5d5903a30403f5f", "content": "### TASK DESCRIPTION We provide training data for all language pairs, and a common framework. The task is to improve current methods. We encourage a broad participation -- if you feel that your method is interesting but not state-of-the-art, then please participate in order to disseminate it and measure progress. Participants will use their systems to translate a test set of unseen sentences in the source language. The translation quality is measured by a manual evaluation and various automatic evaluation metrics. Participants agree to contribute to the manual evaluation about eight hours of work, per system submission. You may participate in any or all of the eight language pairs. For all language pairs we will test translation in both directions. To have a common framework that allows for comparable results, and also to lower the barrier to entry, we provide a common training set, and a pre-processed version (TBC). You are not limited to this training set, and you are not limited to the training set provided for your target language pair. This means that multilingual systems are allowed, and classed as constrained as long as they use only data released for WMT19 (or older WMT Hindi-English and Turkish-English corpora,", "metadata": {"heading": "### TASK DESCRIPTION", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "position": 0, "word_count": 200, "char_count": 1239, "nested_level": 2, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371447", "chunk_type": "content_chunk"}
{"id": "0268cb8b52024fd3c966e321d568312a", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### TASK DESCRIPTION\n\nnot limited to the training set provided for your target language pair. This means that multilingual systems are allowed, and classed as constrained as long as they use only data released for WMT19 (or older WMT Hindi-English and Turkish-English corpora, as listed below). If you use additional training data (not provided by the WMT19 organisers) or existing translation systems, you must flag that your system uses additional data. We will distinguish system submissions that used the provided training data (constrained) from submissions that used significant additional data resources. Note that basic linguistic tools such as taggers, parsers, or morphological analyzers are allowed in the constrained condition. Your submission report should highlight in which ways your own methods and data differ from the standard task. You should make it clear which tools you used, and which training sets you used. The following two aspects of the task are new for 2019: Unsupervised learning and Document-level MT. Unsupervised learning For 2019, we also have an unsupervised subtrack: German to Czech translations, using monolingual German and Czech training data only, as well as last years' parallel dev and test sets for bootstrapping. The training data should come from the the constrained monolingual sets", "metadata": {"heading": "### TASK DESCRIPTION", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "position": 1, "word_count": 200, "char_count": 1444, "nested_level": 2, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371460", "chunk_type": "content_chunk"}
{"id": "fb15d506855c9db346f8ca8376c9a906", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### TASK DESCRIPTION\n\nalso have an unsupervised subtrack: German to Czech translations, using monolingual German and Czech training data only, as well as last years' parallel dev and test sets for bootstrapping. The training data should come from the the constrained monolingual sets of WMT news translation data. No German-Czech parallel data is provided, and the participants cannot use any monolingual or parallel data for other languages and language pairs (thus zero-shot, transfer-learning and pivoting-based systems will be treated as part of the general news translation track). Document-level MT In 2019, we are particularly interested in approaches which consider the whole document. We invite submissions of such approaches for English to German and Czech, and for Chinese to English. We will perform document-level human evaluation for these pairs. For English to German, we will be releasing as much of the training data as possible with document boundaries intact. For English to Czech, CzEng 1.7 (unchanged from last year) does already offer cross-sentential context for most of its \"domains\". No complete documents are available but all sentences in a \"block\" (i.e. those with the same \"-bNUM-\" number in the ID, e.g. subtitlesM-b15-00train-f000001-s*) formed a consecutive sequence in the original text. Sometimes the block is", "metadata": {"heading": "### TASK DESCRIPTION", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "position": 2, "word_count": 200, "char_count": 1458, "nested_level": 2, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371472", "chunk_type": "content_chunk"}
{"id": "27411d248740185990867d0c7cd57856", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### TASK DESCRIPTION\n\nfor most of its \"domains\". No complete documents are available but all sentences in a \"block\" (i.e. those with the same \"-bNUM-\" number in the ID, e.g. subtitlesM-b15-00train-f000001-s*) formed a consecutive sequence in the original text. Sometimes the block is very short (just 1 sentence), and it is always limited to 13 or 15 sentences. No context information is available for the domains \"techdoc\", \"navajo\" and \"tweets\". The best context-aware domains are \"news\", \"eu\", \"subtitles*\" (well, subtitles) and \"fiction\". Additional Test Suites Linked to News Translation Task At no additional burden on the News Translation Task participants (aside from having to translate much larger input data), we will again collectively provide a deeper analysis of various qualities of the translations. See the corresponding section of Findings 2018 for an inspiration. See WMT19 Test Suites Google Document for more details. System developers may want to learn in advance what their systems will be tested on. Everyone is welcome to contribute additional test suites. Authors of additional test suites will be invited to report on their evaluation method and its results in a separate paper DATA LICENSING OF DATA The data released for the WMT19 news translation task can be freely used", "metadata": {"heading": "### TASK DESCRIPTION", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "position": 3, "word_count": 200, "char_count": 1415, "nested_level": 2, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371483", "chunk_type": "content_chunk"}
{"id": "67156eee465fa0ef3aefe36953a46c97", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### TASK DESCRIPTION\n\ntest suites. Authors of additional test suites will be invited to report on their evaluation method and its results in a separate paper DATA LICENSING OF DATA The data released for the WMT19 news translation task can be freely used for research purposes, we just ask that you cite the WMT19 shared task overview paper, and respect any additional citation requirements on the individual data sets. For other uses of the data, you should consult with original owners of the data sets. TRAINING DATA We aim to use publicly available sources of data wherever possible. Our main sources of training data are the Europarl corpus, the UN corpus, the news-commentary corpus and the ParaCrawl corpus. We also release a monolingual News Crawl corpus. Other language-specific corpora will be made available. We have added suitable additional training data to some of the language pairs. You may also use the following monolingual corpora released by the LDC: LDC2011T07 English Gigaword Fifth Edition LDC2009T13 English Gigaword Fourth Edition LDC2007T07 English Gigaword Third Edition LDC2009T27 Chinese Gigaword Fourth Edition", "metadata": {"heading": "### TASK DESCRIPTION", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "position": 4, "word_count": 175, "char_count": 1254, "nested_level": 2, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371494", "chunk_type": "content_chunk"}
{"id": "be517c344a3f4aaa70ad125eef2f3a08", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### TASK DESCRIPTION\n\nLDC2009T13 English Gigaword Fourth Edition LDC2007T07 English Gigaword Third Edition LDC2009T27 Chinese Gigaword Fourth Edition", "metadata": {"heading": "### TASK DESCRIPTION", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "position": 5, "word_count": 15, "char_count": 264, "nested_level": 2, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371499", "chunk_type": "content_chunk"}
{"id": "494061f4e6281c65c27d21a966d2d2c7", "content": "#### Unsupervised learning\n\nFor 2019, we also have an unsupervised subtrack: German to Czech translations, using monolingual German and Czech training data only, as well as last years' parallel dev and test sets for bootstrapping. The training data should come from the the constrained monolingual sets of WMT news translation data.\n\nNo German-Czech parallel data is provided, and the participants cannot use any monolingual or parallel data for other languages and language pairs (thus zero-shot, transfer-learning and pivoting-based systems will be treated as part of the general news translation track).\n\n", "metadata": {"heading": "#### Unsupervised learning", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION > Unsupervised learning", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION", "Unsupervised learning"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "TASK DESCRIPTION", "level": 3, "markdown": "### TASK DESCRIPTION"}], "domain": "www.statmt.org", "word_count": 90, "char_count": 608, "nested_level": 3}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371509", "chunk_type": "section"}
{"id": "3d0fc4928b2dbe18b5d9f8e7e889e963", "content": "#### Document-level MT In 2019, we are particularly interested in approaches which consider the whole document. We invite submissions of such approaches for English to German and Czech, and for Chinese to English. We will perform document-level human evaluation for these pairs. For English to German, we will be releasing as much of the training data as possible with document boundaries intact. For English to Czech, CzEng 1.7 (unchanged from last year) does already offer cross-sentential context for most of its \"domains\". No complete documents are available but all sentences in a \"block\" (i.e. those with the same \"-bNUM-\" number in the ID, e.g. subtitlesM-b15-00train-f000001-s*) formed a consecutive sequence in the original text. Sometimes the block is very short (just 1 sentence), and it is always limited to 13 or 15 sentences. No context information is available for the domains \"techdoc\", \"navajo\" and \"tweets\". The best context-aware domains are \"news\", \"eu\", \"subtitles*\" (well, subtitles) and \"fiction\".", "metadata": {"heading": "#### Document-level MT", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION > Document-level MT", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION", "Document-level MT"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "TASK DESCRIPTION", "level": 3, "markdown": "### TASK DESCRIPTION"}], "domain": "www.statmt.org", "position": 0, "word_count": 156, "char_count": 1020, "nested_level": 3, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371529", "chunk_type": "content_chunk"}
{"id": "8a0633d54f08426fe7c1fb6ca365d1f1", "content": "#### Additional Test Suites Linked to News Translation Task\n\nAt no additional burden on the News Translation Task participants (aside from having to translate much larger input data), we will again collectively provide a deeper analysis of various qualities of the translations. See the corresponding section of Findings 2018 for an inspiration.\n\nSee WMT19 Test Suites Google Document for more details.\n\n- System developers may want to learn in advance what their systems will be tested on.\n- Everyone is welcome to contribute additional test suites.\n\nAuthors of additional test suites will be invited to report on their evaluation method and its results in a separate paper\n\n", "metadata": {"heading": "#### Additional Test Suites Linked to News Translation Task", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TASK DESCRIPTION > Additional Test Suites Linked to News Translation Task", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TASK DESCRIPTION", "Additional Test Suites Linked to News Translation Task"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "TASK DESCRIPTION", "level": 3, "markdown": "### TASK DESCRIPTION"}], "domain": "www.statmt.org", "word_count": 107, "char_count": 676, "nested_level": 3}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371538", "chunk_type": "section"}
{"id": "8a03b52a4e8539f9cb76a926da9bce30", "content": "### DATA\n\n", "metadata": {"heading": "### DATA", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "word_count": 2, "char_count": 10, "nested_level": 2}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371543", "chunk_type": "section"}
{"id": "a66e04aa9362a8636f201f5a6d214485", "content": "#### LICENSING OF DATA\n\nThe data released for the WMT19 news translation task can be freely used for research purposes, we just ask that you cite the WMT19 shared task overview paper, and respect any additional citation requirements on the individual data sets. For other uses of the data, you should consult with original owners of the data sets.\n\n", "metadata": {"heading": "#### LICENSING OF DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > LICENSING OF DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "LICENSING OF DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "word_count": 59, "char_count": 349, "nested_level": 3}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371549", "chunk_type": "section"}
{"id": "b25a9ff2595e0d74c3566c7942cf37b9", "content": "#### TRAINING DATA We aim to use publicly available sources of data wherever possible. Our main sources of training data are the Europarl corpus, the UN corpus, the news-commentary corpus and the ParaCrawl corpus. We also release a monolingual News Crawl corpus. Other language-specific corpora will be made available. We have added suitable additional training data to some of the language pairs. - LDC2011T07 English Gigaword Fifth Edition LDC2009T13 English Gigaword Fourth Edition LDC2007T07 English Gigaword Third Edition LDC2009T27 Chinese Gigaword Fourth Edition Note that the released data is not tokenized and includes sentences of any length (including empty sentences). All data is in Unicode (UTF-8) format. The following Moses tools allow the processing of the training data into tokenized format: Tokenizer tokenizer.perl Detokenizer detokenizer.perl Lowercaser lowercase.perl SGML Wrapper wrap-xml.perl These tools are available in the Moses git repository. - Tokenizer tokenizer.perl Detokenizer detokenizer.perl Lowercaser lowercase.perl SGML Wrapper wrap-xml.perl", "metadata": {"heading": "#### TRAINING DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > TRAINING DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "TRAINING DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 0, "word_count": 149, "char_count": 1081, "nested_level": 3, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371567", "chunk_type": "content_chunk"}
{"id": "d4f38f17d6cd05ad2f2ea1fef049a1d2", "content": "#### DEVELOPMENT DATA To evaluate your system during development, we suggest using the 2018 test set. The data is provided in raw text format and in an SGML format that suits the NIST scoring tool. We also release other dev and test sets from previous years. For the new language pairs, we release dev sets in January, prepared in the same way as the test sets. The 2019 test sets will be created from a sample of online newspapers from September-November 2018. For the established languages (i.e. English to/from Chinese, Czech, German, Finnish and Russian) the English-X and X-English test sets will be distinct, and only consist of documents created originally in the source language. For the new languages (i.e English to/from Gujarati, Kazakh and Lithuanian) the test sets include 50% English-X translation, and 50% X-English translation. In previous recent tasks, all the test data was created using the latter method. We have released development data for the tasks that are new this year. It is created in the same way as the test set and included in the development tarball. The news-test2011 set has three additional Czech translations that you may want to use. You can download them from", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 0, "word_count": 200, "char_count": 1198, "nested_level": 3, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371708", "chunk_type": "content_chunk"}
{"id": "2fbeaff3d8ece1221c26037dd8597997", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nare new this year. It is created in the same way as the test set and included in the development tarball. The news-test2011 set has three additional Czech translations that you may want to use. You can download them from Charles University. DOWNLOAD Parallel data: File CS-EN DE-EN FI-EN GU-EN KK-EN LT-EN RU-EN ZH-EN FR-DE Notes Europarl v9 ✓ ✓ ✓ ✓ ✓ * New: Re-extracted to include document boundaries. *: europarl-v7 for fr-de ParaCrawl v3 ✓ ✓ ✓ ✓ ✓ ✓ New version for 2019 (except en-ru). Please use the bicleaner filtered version. Common Crawl corpus ✓ ✓ ✓ ✓ * Same as last year. *: new for fr-de News Commentary v14 ✓ ✓ ✓ ✓ ✓ ✓ Updated, and now with document boundaries. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. CzEng 1.7 ✓ Register and download CzEng 1.7. (cross-sentential context available for some domains) Yandex Corpus ✓ ru-en Wiki Titles v1 ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ New release for 2019 UN Parallel Corpus V1.0 ✓ ✓ Register and download Rapid corpus of EU", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 1, "word_count": 200, "char_count": 1212, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371724", "chunk_type": "content_chunk"}
{"id": "ed1ce78af627df7fab0a63974f58d108", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nCzEng 1.7. (cross-sentential context available for some domains) Yandex Corpus ✓ ru-en Wiki Titles v1 ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ New release for 2019 UN Parallel Corpus V1.0 ✓ ✓ Register and download Rapid corpus of EU press releases ✓ ✓ This is part of the Tilde Model Corpus Document-split Rapid corpus ✓ New A recrawled version of the Rapid corpus, with document boundaries intact. Also prepared by Tilde. CWMT Corpus ✓ Additional training data for Gujarati-English The only gu-en corpus listed above is Wikititles. In addition, we propose the following data-sets, as well as specifically encouraging unconstrained submissions (i.e. bring your own data). The Bible Corpus, extracted from data available here A Localisation extracted from OPUS, and consisting mainly of open-source software localisation data. The Emille Corpus, available from ELRA, free for academic use. The Emille corpus is not actually parallel, but does contain some parallel text. Some small corpora which seem to be only available to Indian citizens Crowd-sourced bilingual dictionaries collected by Ellie Pavlick and collaborators The HindEnCorp created by CUNI, or the larger one created by IIT Bombay for the Workshop on Asian Language Translation shared task. If pivoting through Hindi is feasible,", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 2, "word_count": 200, "char_count": 1414, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371740", "chunk_type": "content_chunk"}
{"id": "ea4a2dd8696efc90249115ac00333c4e", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nto Indian citizens Crowd-sourced bilingual dictionaries collected by Ellie Pavlick and collaborators The HindEnCorp created by CUNI, or the larger one created by IIT Bombay for the Workshop on Asian Language Translation shared task. If pivoting through Hindi is feasible, then these would be useful. A parallel corpus extracted from wikipedia and contributed by Alexander Molchanov of PROMT. A crawled corpus produced for this task. It is very noisy, but contains some parallel data. A cleaned version is also available, cleaned using language detection and simple length heuristics. We recommened that you either use the cleaned version, or apply your own cleaning to the raw version. You can use the wikipedia en and gu dumps as a comparable corpus. Additional training data for Kazakh-English In addition to the wikititles and news-commentary above, we provide: An English-Kazakh crawled corpus of about 100k sentences, prepared by Bagdat Myrzakhmetov of Nazarbayev University. The corpus is distributed as a tsv file with the original URLs included, as well as an alignment score. A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. A an additional English-Kazakh crawled corpus of about 500k sentences, also prepared by Bagdat Myrzakhmetov. NB: this was not", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 3, "word_count": 200, "char_count": 1450, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371753", "chunk_type": "content_chunk"}
{"id": "3a4491eac50bbd7c988f87d3daf43cd7", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nURLs included, as well as an alignment score. A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. A an additional English-Kazakh crawled corpus of about 500k sentences, also prepared by Bagdat Myrzakhmetov. NB: this was not part of the task training data We created a -wmt19 version of the news-commentary corpus, which has the dev set removed. You may also use any of the data previously released for the English-Turkish task. Monolingual training data: Corpus CS DE EN FI GU KK LT RU ZH FR Notes News crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Large corpora of crawled news, collected since 2007. Versions up to 2017 are as before, except they are re-filtered and re-shuffled. For de and en, document-split versions are available. News discussions ✓ ✓ Updated Corpora crawled from comment sections of online newspapers. Available in English and French. Europarl ✓ ✓ ✓ ✓ ✓ ✓ * Monolingual version of European parliament crawl. Superset of the parallel version. *: europarl-v7 for fr News Commentary ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Monolingual text from news-commentary crawl. Superset of parallel version. Use v14. NB For the kk-en task, we", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 4, "word_count": 200, "char_count": 1310, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371769", "chunk_type": "content_chunk"}
{"id": "48ab6e7fe31687aeb7f78ff963238e90", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nof European parliament crawl. Superset of the parallel version. *: europarl-v7 for fr News Commentary ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Monolingual text from news-commentary crawl. Superset of parallel version. Use v14. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. Common Crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Deduplicated with development and evaluation sentences removed. English was updated 31 January 2016 to remove bad UTF-8. Downloads can be verified with SHA512 checksums. More English is available for unconstrained participants. Wiki dumps ✓ ✓ ✓ New Monolingual text wikipedia, extracted using WikiExtractor. Development sets Test sets Test sets (including additional test suites) PREPROCESSED DATA We will provide preprocessed versions of all training and development data (by mid-February). These are preprocesed with standard Moses tools and ready for use in MT training. This preprocessed data is distributed with the intention that it will be useful as a standard data set for future research. The preprocessed data can be obtained here TEST SET SUBMISSION To submit your results, please first convert into into SGML format as", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 5, "word_count": 200, "char_count": 1367, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371783", "chunk_type": "content_chunk"}
{"id": "03c5e1460772c07cca60ff19640a81a6", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nis distributed with the intention that it will be useful as a standard data set for future research. The preprocessed data can be obtained here TEST SET SUBMISSION To submit your results, please first convert into into SGML format as required by the NIST BLEU scorer, and then upload it to the website matrix.statmt.org. For Chinese output, you should submit unsegmented text, since our primary measure is human evaluation. For automatic scoring (in the matrix) we use BLEU4 computed on characters, scoring with v1.3 of the NIST scorer only. A script to convert a Chinese SGM file to characters can be found here. SGML Format Each submitted file has to be in a format that is used by standard scoring scripts such as NIST BLEU or TER. This format is similar to the one used in the source test set files that were released, except for: First line is <tstset trglang=\"en\" setid=\"newstest2019\" srclang=\"any\">, with trglang set to either en, de, fr, es, cs or ru. Important: srclang is always any. Each document tag also has to include the system name, e.g. sysid=\"uedin\". CLosing tag (last line) is </tstset> The script wrap-xml.perl makes the conversion of a output file in one-segment-per-line", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 6, "word_count": 200, "char_count": 1339, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371795", "chunk_type": "content_chunk"}
{"id": "4fc71b12a7ca0afd82afa5d5d1092ca4", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nfr, es, cs or ru. Important: srclang is always any. Each document tag also has to include the system name, e.g. sysid=\"uedin\". CLosing tag (last line) is </tstset> The script wrap-xml.perl makes the conversion of a output file in one-segment-per-line format into the required SGML file very easy: Format: wrap-xml.perl LANGUAGE SRC_SGML_FILE SYSTEM_NAME < IN > OUT Example: wrap-xml.perl en newstest2019-src.de.sgm Google < decoder-output > decoder-output.sgm Upload to Website Upload happens in three easy steps: Go to the website matrix.statmt.org. Create an account under the menu item Account -> Create Account. Go to Account -> upload/edit content, and follow the link \"Submit a system run\" select as test set \"newstest2019\" and the language pair you are submitting select \"create new system\" click \"continue\" on the next page, upload your file and add some description You can use the matrix to list all your systems, and edit the metadata. This is important since after the test week ends, you need to decide which are your primary systems (that get included in the human evaluation, and the overview paper) and to ensure that you are happy with the system naming. To access your system list, log in and select Account -> my", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 7, "word_count": 200, "char_count": 1378, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371805", "chunk_type": "content_chunk"}
{"id": "5e8e6b1d912ad2044f1e5b521e98a532", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\ndecide which are your primary systems (that get included in the human evaluation, and the overview paper) and to ensure that you are happy with the system naming. To access your system list, log in and select Account -> my current systems. You should see a list of all your systems, along with their metadata, and an edit button. Some instructions are included on this screen. EVALUATION Evaluation will be done both automatically as well as by human judgement. Manual Scoring: We will collect subjective judgments about translation quality from human annotators. If you participate in the shared task, we ask you to perform a defined amount of evaluation per language pair submitted. The amount of manual evaluation will be approximately 8 hours. As in previous years, we expect the translated submissions to be in recased, detokenized, XML format, just as in most other translation campaigns (NIST, TC-Star). ACKNOWLEDGEMENTS This task would not have been possible without the sponsorship of test sets from Microsoft, Yandex, Tilde, LinguaCustodia, the University of Helsinki, Charles University Prague, Le Mans University and funding from the European Union's Horizon 2020 research and innovation programme under grant agreements 825299 (GOURMET) and EU CHIST-ERA M2CR project. The", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 8, "word_count": 200, "char_count": 1431, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371819", "chunk_type": "content_chunk"}
{"id": "b2f8fcb6a9b10fec59721678441a9bc2", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\ntest sets from Microsoft, Yandex, Tilde, LinguaCustodia, the University of Helsinki, Charles University Prague, Le Mans University and funding from the European Union's Horizon 2020 research and innovation programme under grant agreements 825299 (GOURMET) and EU CHIST-ERA M2CR project. The news-test2011 set has three additional Czech translations that you may want to use. You can download them from Charles University. DOWNLOAD Parallel data: File CS-EN DE-EN FI-EN GU-EN KK-EN LT-EN RU-EN ZH-EN FR-DE Notes Europarl v9 ✓ ✓ ✓ ✓ ✓ * New: Re-extracted to include document boundaries. *: europarl-v7 for fr-de ParaCrawl v3 ✓ ✓ ✓ ✓ ✓ ✓ New version for 2019 (except en-ru). Please use the bicleaner filtered version. Common Crawl corpus ✓ ✓ ✓ ✓ * Same as last year. *: new for fr-de News Commentary v14 ✓ ✓ ✓ ✓ ✓ ✓ Updated, and now with document boundaries. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. CzEng 1.7 ✓ Register and download CzEng 1.7. (cross-sentential context available for some domains) Yandex Corpus ✓ ru-en Wiki Titles v1 ✓ ✓ ✓ ✓ ✓ ✓ ✓", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 9, "word_count": 200, "char_count": 1301, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371835", "chunk_type": "content_chunk"}
{"id": "23418bbd269e6cea640d3f63efac30f2", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\ncreated -wmt19 versions of the corpora, which have the dev set removed. CzEng 1.7 ✓ Register and download CzEng 1.7. (cross-sentential context available for some domains) Yandex Corpus ✓ ru-en Wiki Titles v1 ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ New release for 2019 UN Parallel Corpus V1.0 ✓ ✓ Register and download Rapid corpus of EU press releases ✓ ✓ This is part of the Tilde Model Corpus Document-split Rapid corpus ✓ New A recrawled version of the Rapid corpus, with document boundaries intact. Also prepared by Tilde. CWMT Corpus ✓ Additional training data for Gujarati-English The only gu-en corpus listed above is Wikititles. In addition, we propose the following data-sets, as well as specifically encouraging unconstrained submissions (i.e. bring your own data). The Bible Corpus, extracted from data available here A Localisation extracted from OPUS, and consisting mainly of open-source software localisation data. The Emille Corpus, available from ELRA, free for academic use. The Emille corpus is not actually parallel, but does contain some parallel text. Some small corpora which seem to be only available to Indian citizens Crowd-sourced bilingual dictionaries collected by Ellie Pavlick and collaborators The HindEnCorp created by CUNI, or the larger one created", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 10, "word_count": 200, "char_count": 1407, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371849", "chunk_type": "content_chunk"}
{"id": "474b3d53588cfd57a6af3d25ed8baf24", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nnot actually parallel, but does contain some parallel text. Some small corpora which seem to be only available to Indian citizens Crowd-sourced bilingual dictionaries collected by Ellie Pavlick and collaborators The HindEnCorp created by CUNI, or the larger one created by IIT Bombay for the Workshop on Asian Language Translation shared task. If pivoting through Hindi is feasible, then these would be useful. A parallel corpus extracted from wikipedia and contributed by Alexander Molchanov of PROMT. A crawled corpus produced for this task. It is very noisy, but contains some parallel data. A cleaned version is also available, cleaned using language detection and simple length heuristics. We recommened that you either use the cleaned version, or apply your own cleaning to the raw version. You can use the wikipedia en and gu dumps as a comparable corpus. Additional training data for Kazakh-English In addition to the wikititles and news-commentary above, we provide: An English-Kazakh crawled corpus of about 100k sentences, prepared by Bagdat Myrzakhmetov of Nazarbayev University. The corpus is distributed as a tsv file with the original URLs included, as well as an alignment score. A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. A", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 11, "word_count": 200, "char_count": 1437, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371859", "chunk_type": "content_chunk"}
{"id": "6cb0f42537f6721c4ebb282e2bb9bc3b", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nprepared by Bagdat Myrzakhmetov of Nazarbayev University. The corpus is distributed as a tsv file with the original URLs included, as well as an alignment score. A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. A an additional English-Kazakh crawled corpus of about 500k sentences, also prepared by Bagdat Myrzakhmetov. NB: this was not part of the task training data We created a -wmt19 version of the news-commentary corpus, which has the dev set removed. You may also use any of the data previously released for the English-Turkish task. Monolingual training data: Corpus CS DE EN FI GU KK LT RU ZH FR Notes News crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Large corpora of crawled news, collected since 2007. Versions up to 2017 are as before, except they are re-filtered and re-shuffled. For de and en, document-split versions are available. News discussions ✓ ✓ Updated Corpora crawled from comment sections of online newspapers. Available in English and French. Europarl ✓ ✓ ✓ ✓ ✓ ✓ * Monolingual version of European parliament crawl. Superset of the parallel version. *: europarl-v7 for fr News Commentary ✓ ✓ ✓ ✓ ✓ ✓ ✓", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 12, "word_count": 200, "char_count": 1308, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371873", "chunk_type": "content_chunk"}
{"id": "025dba8e5e9973b9c463817fc96cd719", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nof online newspapers. Available in English and French. Europarl ✓ ✓ ✓ ✓ ✓ ✓ * Monolingual version of European parliament crawl. Superset of the parallel version. *: europarl-v7 for fr News Commentary ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Monolingual text from news-commentary crawl. Superset of parallel version. Use v14. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. Common Crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Deduplicated with development and evaluation sentences removed. English was updated 31 January 2016 to remove bad UTF-8. Downloads can be verified with SHA512 checksums. More English is available for unconstrained participants. Wiki dumps ✓ ✓ ✓ New Monolingual text wikipedia, extracted using WikiExtractor. Development sets Test sets Test sets (including additional test suites) PREPROCESSED DATA We will provide preprocessed versions of all training and development data (by mid-February). These are preprocesed with standard Moses tools and ready for use in MT training. This preprocessed data is distributed with the intention that it will be useful as a standard data set for future research. The preprocessed data can", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 13, "word_count": 200, "char_count": 1358, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371886", "chunk_type": "content_chunk"}
{"id": "873a1d3d5f33d9d187f3b3b00c38aa6d", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nmid-February). These are preprocesed with standard Moses tools and ready for use in MT training. This preprocessed data is distributed with the intention that it will be useful as a standard data set for future research. The preprocessed data can be obtained here TEST SET SUBMISSION To submit your results, please first convert into into SGML format as required by the NIST BLEU scorer, and then upload it to the website matrix.statmt.org. For Chinese output, you should submit unsegmented text, since our primary measure is human evaluation. For automatic scoring (in the matrix) we use BLEU4 computed on characters, scoring with v1.3 of the NIST scorer only. A script to convert a Chinese SGM file to characters can be found here. SGML Format Each submitted file has to be in a format that is used by standard scoring scripts such as NIST BLEU or TER. This format is similar to the one used in the source test set files that were released, except for: First line is <tstset trglang=\"en\" setid=\"newstest2019\" srclang=\"any\">, with trglang set to either en, de, fr, es, cs or ru. Important: srclang is always any. Each document tag also has to include the system name, e.g. sysid=\"uedin\".", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 14, "word_count": 200, "char_count": 1335, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371896", "chunk_type": "content_chunk"}
{"id": "8d8c46c620532660c05a711c1fa5667c", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nwere released, except for: First line is <tstset trglang=\"en\" setid=\"newstest2019\" srclang=\"any\">, with trglang set to either en, de, fr, es, cs or ru. Important: srclang is always any. Each document tag also has to include the system name, e.g. sysid=\"uedin\". CLosing tag (last line) is </tstset> The script wrap-xml.perl makes the conversion of a output file in one-segment-per-line format into the required SGML file very easy: Format: wrap-xml.perl LANGUAGE SRC_SGML_FILE SYSTEM_NAME < IN > OUT Example: wrap-xml.perl en newstest2019-src.de.sgm Google < decoder-output > decoder-output.sgm Upload to Website Upload happens in three easy steps: Go to the website matrix.statmt.org. Create an account under the menu item Account -> Create Account. Go to Account -> upload/edit content, and follow the link \"Submit a system run\" select as test set \"newstest2019\" and the language pair you are submitting select \"create new system\" click \"continue\" on the next page, upload your file and add some description You can use the matrix to list all your systems, and edit the metadata. This is important since after the test week ends, you need to decide which are your primary systems (that get included in the human evaluation, and the overview paper) and to ensure that you", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 15, "word_count": 200, "char_count": 1418, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371906", "chunk_type": "content_chunk"}
{"id": "a994e0512920c8a8a42d389f15745c9f", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nyour systems, and edit the metadata. This is important since after the test week ends, you need to decide which are your primary systems (that get included in the human evaluation, and the overview paper) and to ensure that you are happy with the system naming. To access your system list, log in and select Account -> my current systems. You should see a list of all your systems, along with their metadata, and an edit button. Some instructions are included on this screen. EVALUATION Evaluation will be done both automatically as well as by human judgement. Manual Scoring: We will collect subjective judgments about translation quality from human annotators. If you participate in the shared task, we ask you to perform a defined amount of evaluation per language pair submitted. The amount of manual evaluation will be approximately 8 hours. As in previous years, we expect the translated submissions to be in recased, detokenized, XML format, just as in most other translation campaigns (NIST, TC-Star). ACKNOWLEDGEMENTS This task would not have been possible without the sponsorship of test sets from Microsoft, Yandex, Tilde, LinguaCustodia, the University of Helsinki, Charles University Prague, Le Mans University and funding from the European", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 16, "word_count": 200, "char_count": 1400, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371916", "chunk_type": "content_chunk"}
{"id": "adc39a1cee833cdaf6fa49e4f2a4e8f4", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DEVELOPMENT DATA\n\nmost other translation campaigns (NIST, TC-Star). ACKNOWLEDGEMENTS This task would not have been possible without the sponsorship of test sets from Microsoft, Yandex, Tilde, LinguaCustodia, the University of Helsinki, Charles University Prague, Le Mans University and funding from the European Union's Horizon 2020 research and innovation programme under grant agreements 825299 (GOURMET) and EU CHIST-ERA M2CR project. The news-test2011 set has three additional Czech translations that you may want to use. You can download them from Charles University.", "metadata": {"heading": "#### DEVELOPMENT DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DEVELOPMENT DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DEVELOPMENT DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 17, "word_count": 78, "char_count": 701, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.371923", "chunk_type": "content_chunk"}
{"id": "779770341df44bdd2b70f08537b3b213", "content": "#### DOWNLOAD - Parallel data: File CS-EN DE-EN FI-EN GU-EN KK-EN LT-EN RU-EN ZH-EN FR-DE Notes Europarl v9 ✓ ✓ ✓ ✓ ✓ * New: Re-extracted to include document boundaries. *: europarl-v7 for fr-de ParaCrawl v3 ✓ ✓ ✓ ✓ ✓ ✓ New version for 2019 (except en-ru). Please use the bicleaner filtered version. Common Crawl corpus ✓ ✓ ✓ ✓ * Same as last year. *: new for fr-de News Commentary v14 ✓ ✓ ✓ ✓ ✓ ✓ Updated, and now with document boundaries. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. CzEng 1.7 ✓ Register and download CzEng 1.7. (cross-sentential context available for some domains) Yandex Corpus ✓ ru-en Wiki Titles v1 ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ New release for 2019 UN Parallel Corpus V1.0 ✓ ✓ Register and download Rapid corpus of EU press releases ✓ ✓ This is part of the Tilde Model Corpus Document-split Rapid corpus ✓ New A recrawled version of the Rapid corpus, with document boundaries intact. Also prepared by Tilde. CWMT Corpus ✓ Additional training data for Gujarati-English", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 0, "word_count": 200, "char_count": 1081, "nested_level": 3, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372027", "chunk_type": "content_chunk"}
{"id": "7a8fca84008fedc45e2f3f12b6852475", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DOWNLOAD\n\npress releases ✓ ✓ This is part of the Tilde Model Corpus Document-split Rapid corpus ✓ New A recrawled version of the Rapid corpus, with document boundaries intact. Also prepared by Tilde. CWMT Corpus ✓ Additional training data for Gujarati-English The only gu-en corpus listed above is Wikititles. In addition, we propose the following data-sets, as well as specifically encouraging unconstrained submissions (i.e. bring your own data). The Bible Corpus, extracted from data available here A Localisation extracted from OPUS, and consisting mainly of open-source software localisation data. The Emille Corpus, available from ELRA, free for academic use. The Emille corpus is not actually parallel, but does contain some parallel text. Some small corpora which seem to be only available to Indian citizens Crowd-sourced bilingual dictionaries collected by Ellie Pavlick and collaborators The HindEnCorp created by CUNI, or the larger one created by IIT Bombay for the Workshop on Asian Language Translation shared task. If pivoting through Hindi is feasible, then these would be useful. A parallel corpus extracted from wikipedia and contributed by Alexander Molchanov of PROMT. A crawled corpus produced for this task. It is very noisy, but contains some parallel data. A cleaned version is also available,", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 1, "word_count": 200, "char_count": 1447, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372043", "chunk_type": "content_chunk"}
{"id": "967d22cbfac98257fc5ee0cfc3e4ffc4", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DOWNLOAD\n\nthen these would be useful. A parallel corpus extracted from wikipedia and contributed by Alexander Molchanov of PROMT. A crawled corpus produced for this task. It is very noisy, but contains some parallel data. A cleaned version is also available, cleaned using language detection and simple length heuristics. We recommened that you either use the cleaned version, or apply your own cleaning to the raw version. You can use the wikipedia en and gu dumps as a comparable corpus. Additional training data for Kazakh-English In addition to the wikititles and news-commentary above, we provide: An English-Kazakh crawled corpus of about 100k sentences, prepared by Bagdat Myrzakhmetov of Nazarbayev University. The corpus is distributed as a tsv file with the original URLs included, as well as an alignment score. A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. A an additional English-Kazakh crawled corpus of about 500k sentences, also prepared by Bagdat Myrzakhmetov. NB: this was not part of the task training data We created a -wmt19 version of the news-commentary corpus, which has the dev set removed. You may also use any of the data previously released for the English-Turkish task. Monolingual training data: Corpus CS", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 2, "word_count": 200, "char_count": 1411, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372055", "chunk_type": "content_chunk"}
{"id": "5c6cef44d76e3244defe96ec8958acc6", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DOWNLOAD\n\npart of the task training data We created a -wmt19 version of the news-commentary corpus, which has the dev set removed. You may also use any of the data previously released for the English-Turkish task. Monolingual training data: Corpus CS DE EN FI GU KK LT RU ZH FR Notes News crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Large corpora of crawled news, collected since 2007. Versions up to 2017 are as before, except they are re-filtered and re-shuffled. For de and en, document-split versions are available. News discussions ✓ ✓ Updated Corpora crawled from comment sections of online newspapers. Available in English and French. Europarl ✓ ✓ ✓ ✓ ✓ ✓ * Monolingual version of European parliament crawl. Superset of the parallel version. *: europarl-v7 for fr News Commentary ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Monolingual text from news-commentary crawl. Superset of parallel version. Use v14. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. Common Crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Deduplicated with development and evaluation", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 3, "word_count": 200, "char_count": 1238, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372069", "chunk_type": "content_chunk"}
{"id": "207bbed940697f5ed70392eb0db71bb1", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DOWNLOAD\n\ninclude part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. Common Crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Deduplicated with development and evaluation sentences removed. English was updated 31 January 2016 to remove bad UTF-8. Downloads can be verified with SHA512 checksums. More English is available for unconstrained participants. Wiki dumps ✓ ✓ ✓ New Monolingual text wikipedia, extracted using WikiExtractor. Development sets Test sets Test sets (including additional test suites) The only gu-en corpus listed above is Wikititles. In addition, we propose the following data-sets, as well as specifically encouraging unconstrained submissions (i.e. bring your own data). - The Bible Corpus, extracted from data available here - A Localisation extracted from OPUS, and consisting mainly of open-source software localisation data. - The Emille Corpus, available from ELRA, free for academic use. The Emille corpus is not actually parallel, but does contain some parallel text. - Some small corpora which seem to be only available to Indian citizens - Crowd-sourced bilingual dictionaries collected by Ellie Pavlick and collaborators - The HindEnCorp created by CUNI, or the larger one created by IIT Bombay for", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 4, "word_count": 200, "char_count": 1401, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372082", "chunk_type": "content_chunk"}
{"id": "828ab88d995cafef5ce46b9a7875ab37", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DOWNLOAD\n\nparallel text. - Some small corpora which seem to be only available to Indian citizens - Crowd-sourced bilingual dictionaries collected by Ellie Pavlick and collaborators - The HindEnCorp created by CUNI, or the larger one created by IIT Bombay for the Workshop on Asian Language Translation shared task. If pivoting through Hindi is feasible, then these would be useful. - A parallel corpus extracted from wikipedia and contributed by Alexander Molchanov of PROMT. - A crawled corpus produced for this task. It is very noisy, but contains some parallel data. A cleaned version is also available, cleaned using language detection and simple length heuristics. We recommened that you either use the cleaned version, or apply your own cleaning to the raw version. - You can use the wikipedia en and gu dumps as a comparable corpus. In addition to the wikititles and news-commentary above, we provide: An English-Kazakh crawled corpus of about 100k sentences, prepared by Bagdat Myrzakhmetov of Nazarbayev University. The corpus is distributed as a tsv file with the original URLs included, as well as an alignment score. A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. A an additional English-Kazakh crawled corpus of", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 5, "word_count": 200, "char_count": 1399, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372092", "chunk_type": "content_chunk"}
{"id": "0f92912421350a41fb9e76ecf11c12c6", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DOWNLOAD\n\nUniversity. The corpus is distributed as a tsv file with the original URLs included, as well as an alignment score. A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. A an additional English-Kazakh crawled corpus of about 500k sentences, also prepared by Bagdat Myrzakhmetov. NB: this was not part of the task training data We created a -wmt19 version of the news-commentary corpus, which has the dev set removed. You may also use any of the data previously released for the English-Turkish task. Monolingual training data: Corpus CS DE EN FI GU KK LT RU ZH FR Notes News crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Large corpora of crawled news, collected since 2007. Versions up to 2017 are as before, except they are re-filtered and re-shuffled. For de and en, document-split versions are available. News discussions ✓ ✓ Updated Corpora crawled from comment sections of online newspapers. Available in English and French. Europarl ✓ ✓ ✓ ✓ ✓ ✓ * Monolingual version of European parliament crawl. Superset of the parallel version. *: europarl-v7 for fr News Commentary ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Monolingual text from news-commentary crawl.", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 6, "word_count": 200, "char_count": 1307, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372105", "chunk_type": "content_chunk"}
{"id": "38bdaf9054925d6a62e24931010af2b0", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DOWNLOAD\n\nand French. Europarl ✓ ✓ ✓ ✓ ✓ ✓ * Monolingual version of European parliament crawl. Superset of the parallel version. *: europarl-v7 for fr News Commentary ✓ ✓ ✓ ✓ ✓ ✓ ✓ Updated Monolingual text from news-commentary crawl. Superset of parallel version. Use v14. NB For the kk-en task, we include part of this data in the dev set, and have created -wmt19 versions of the corpora, which have the dev set removed. Common Crawl ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Deduplicated with development and evaluation sentences removed. English was updated 31 January 2016 to remove bad UTF-8. Downloads can be verified with SHA512 checksums. More English is available for unconstrained participants. Wiki dumps ✓ ✓ ✓ New Monolingual text wikipedia, extracted using WikiExtractor. Development sets Test sets Test sets (including additional test suites) - An English-Kazakh crawled corpus of about 100k sentences, prepared by Bagdat Myrzakhmetov of Nazarbayev University. The corpus is distributed as a tsv file with the original URLs included, as well as an alignment score. - A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. - A an additional English-Kazakh crawled corpus of about 500k sentences,", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 7, "word_count": 200, "char_count": 1353, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372118", "chunk_type": "content_chunk"}
{"id": "769caf51bd098788fb103a4776e0389f", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### DATA\n#### DOWNLOAD\n\nas a tsv file with the original URLs included, as well as an alignment score. - A crawled Russian-Kazakh corpus of about 5M sentences, also prepared by Bagdat Myrzakhmetov. - A an additional English-Kazakh crawled corpus of about 500k sentences, also prepared by Bagdat Myrzakhmetov. NB: this was not part of the task training data - We created a -wmt19 version of the news-commentary corpus, which has the dev set removed. - You may also use any of the data previously released for the English-Turkish task.", "metadata": {"heading": "#### DOWNLOAD", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > DOWNLOAD", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "DOWNLOAD"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "position": 8, "word_count": 86, "char_count": 647, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372125", "chunk_type": "content_chunk"}
{"id": "cc30be8fa1d1b422b8f43eb7224ee02a", "content": "#### PREPROCESSED DATA\n\n", "metadata": {"heading": "#### PREPROCESSED DATA", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > DATA > PREPROCESSED DATA", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "DATA", "PREPROCESSED DATA"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "DATA", "level": 3, "markdown": "### DATA"}], "domain": "www.statmt.org", "word_count": 3, "char_count": 24, "nested_level": 3}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372129", "chunk_type": "section"}
{"id": "e085ff9ef5257fb844b77714c11c649a", "content": "### TEST SET SUBMISSION\n\nTo submit your results, please first convert into into SGML format as required by the NIST BLEU scorer, and then upload it to the website matrix.statmt.org.\n\nFor Chinese output, you should submit unsegmented text, since our primary measure is human evaluation. For automatic scoring (in the matrix) we use BLEU4 computed on characters, scoring with v1.3 of the NIST scorer only. A script to convert a Chinese SGM file to characters can be found here.\n\n", "metadata": {"heading": "### TEST SET SUBMISSION", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TEST SET SUBMISSION", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TEST SET SUBMISSION"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "word_count": 79, "char_count": 477, "nested_level": 2}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372138", "chunk_type": "section"}
{"id": "3e3ccd3cee15ca20bb1a0e52d50440f3", "content": "#### SGML Format Each submitted file has to be in a format that is used by standard scoring scripts such as NIST BLEU or TER. This format is similar to the one used in the source test set files that were released, except for: First line is <tstset trglang=\"en\" setid=\"newstest2019\" srclang=\"any\">, with trglang set to either en, de, fr, es, cs or ru. Important: srclang is always any. Each document tag also has to include the system name, e.g. sysid=\"uedin\". CLosing tag (last line) is </tstset> - First line is <tstset trglang=\"en\" setid=\"newstest2019\" srclang=\"any\">, with trglang set to either en, de, fr, es, cs or ru. Important: srclang is always any. Each document tag also has to include the system name, e.g. sysid=\"uedin\". CLosing tag (last line) is </tstset> The script wrap-xml.perl makes the conversion of a output file in one-segment-per-line format into the required SGML file very easy: Format: wrap-xml.perl LANGUAGE SRC_SGML_FILE SYSTEM_NAME < IN > OUT Example: wrap-xml.perl en newstest2019-src.de.sgm Google < decoder-output > decoder-output.sgm", "metadata": {"heading": "#### SGML Format", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TEST SET SUBMISSION > SGML Format", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TEST SET SUBMISSION", "SGML Format"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "TEST SET SUBMISSION", "level": 3, "markdown": "### TEST SET SUBMISSION"}], "domain": "www.statmt.org", "position": 0, "word_count": 167, "char_count": 1065, "nested_level": 3, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372162", "chunk_type": "content_chunk"}
{"id": "a40f2f5b727c46f200bfd5c7a5915185", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### TEST SET SUBMISSION\n#### SGML Format\n\nen newstest2019-src.de.sgm Google < decoder-output > decoder-output.sgm", "metadata": {"heading": "#### SGML Format", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TEST SET SUBMISSION > SGML Format", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TEST SET SUBMISSION", "SGML Format"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "TEST SET SUBMISSION", "level": 3, "markdown": "### TEST SET SUBMISSION"}], "domain": "www.statmt.org", "position": 1, "word_count": 7, "char_count": 228, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372168", "chunk_type": "content_chunk"}
{"id": "6c88782285ce8fc51250abd74d9f96e6", "content": "#### Upload to Website Upload happens in three easy steps: 1. Go to the website matrix.statmt.org. Create an account under the menu item Account -> Create Account. Go to Account -> upload/edit content, and follow the link \"Submit a system run\" select as test set \"newstest2019\" and the language pair you are submitting select \"create new system\" click \"continue\" on the next page, upload your file and add some description - select as test set \"newstest2019\" and the language pair you are submitting select \"create new system\" click \"continue\" on the next page, upload your file and add some description You can use the matrix to list all your systems, and edit the metadata. This is important since after the test week ends, you need to decide which are your primary systems (that get included in the human evaluation, and the overview paper) and to ensure that you are happy with the system naming. To access your system list, log in and select Account -> my current systems. You should see a list of all your systems, along with their metadata, and an edit button. Some instructions are included on this screen.", "metadata": {"heading": "#### Upload to Website", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TEST SET SUBMISSION > Upload to Website", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TEST SET SUBMISSION", "Upload to Website"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "TEST SET SUBMISSION", "level": 3, "markdown": "### TEST SET SUBMISSION"}], "domain": "www.statmt.org", "position": 0, "word_count": 192, "char_count": 1114, "nested_level": 3, "is_continuation": false}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372184", "chunk_type": "content_chunk"}
{"id": "a8711eadf6c54802bb661f089a4f591f", "content": "# Translation Task - ACL 2019 fourth Conference on Machine Translation\n## Shared Task: Machine Translation of News\n### TEST SET SUBMISSION\n#### Upload to Website\n\nin and select Account -> my current systems. You should see a list of all your systems, along with their metadata, and an edit button. Some instructions are included on this screen.", "metadata": {"heading": "#### Upload to Website", "heading_level": 4, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > TEST SET SUBMISSION > Upload to Website", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "TEST SET SUBMISSION", "Upload to Website"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}, {"text": "TEST SET SUBMISSION", "level": 3, "markdown": "### TEST SET SUBMISSION"}], "domain": "www.statmt.org", "position": 1, "word_count": 32, "char_count": 344, "nested_level": 3, "is_continuation": true}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372190", "chunk_type": "content_chunk"}
{"id": "c27361b8c018c07eee080383e2d20616", "content": "### EVALUATION\n\nEvaluation will be done both automatically as well as by human judgement.\n\n- Manual Scoring: We will collect subjective judgments about translation quality from human annotators. If you participate in the shared task, we ask you to perform a defined amount of evaluation per language pair submitted. The amount of manual evaluation will be approximately 8 hours. As in previous years, we expect the translated submissions to be in recased, detokenized, XML format, just as in most other translation campaigns (NIST, TC-Star).\n\n", "metadata": {"heading": "### EVALUATION", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > EVALUATION", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "EVALUATION"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "word_count": 84, "char_count": 543, "nested_level": 2}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372198", "chunk_type": "section"}
{"id": "a335d0f67eb522f07e28a2be21cda325", "content": "### ACKNOWLEDGEMENTS\n", "metadata": {"heading": "### ACKNOWLEDGEMENTS", "heading_level": 3, "heading_path": "Translation Task - ACL 2019 fourth Conference on Machine Translation > Shared Task: Machine Translation of News > ACKNOWLEDGEMENTS", "path_elements": ["Translation Task - ACL 2019 fourth Conference on Machine Translation", "Shared Task: Machine Translation of News", "ACKNOWLEDGEMENTS"], "parent_headers": [{"text": "Translation Task - ACL 2019 fourth Conference on Machine Translation", "level": 1, "markdown": "# Translation Task - ACL 2019 fourth Conference on Machine Translation"}, {"text": "Shared Task: Machine Translation of News", "level": 2, "markdown": "## Shared Task: Machine Translation of News"}], "domain": "www.statmt.org", "word_count": 2, "char_count": 21, "nested_level": 2}, "source_url": "https://www.statmt.org/wmt19/translation-task.html", "created_at": "2025-06-16T02:59:10.372203", "chunk_type": "section"}
